      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ESCABARTE2.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT OUTPUT-FILE
           ASSIGN TO "D:\Files\Cobol\CS399\ESCABARTE2.DAT".
       DATA DIVISION.
       FILE SECTION.
       FD OUTPUT-FILE
           DATA RECORD IS OUTPUT-REC.
       01 OUTPUT-REC.
           05 ACCOUNT_NUMBER_OUT PIC 9999.
           05 SPACE-01-OUT PIC X(3).
           05 ACCOUNT_NAME_OUT PIC X(21).
           05 SPACE-02-OUT PIC X(3).
           05 PRINCIPAL_AMOUNT_OUT PIC 99999.
           05 SPACE-03-OUT PIC X(3).
           05 YEARS_OF_DEPOSIT_OUT PIC 99.
           05 DIVIDER PIC X(8).
           05 INTEREST-OUT   PIC 999.99.
           05 DIVIDER-02 PIC X(8).
           05 PERCENT-OUT PIC X(3).

       WORKING-STORAGE SECTION.
       01 RECORD_INPUT.
           05 ACCOUNT_NUMBER PIC 99999.
           *>05 SPACE-01 PIC X(3).
           05 ACCOUNT_NAME PIC X(21).
           *>05 SPACE-02 PIC X(3).
           05 PRINCIPAL_AMOUNT PIC 99999.
           *>05 SPACE-03 PIC X(3).
           05 YEARS_OF_DEPOSIT PIC 99.
       01 CHOICE.
           05 THE_CHOICE PIC X VALUE SPACES.
       01  PERCENT PIC X(3).
       01 CONVERT PIC 99999.
       01 INTEREST PIC 999.99.


       SCREEN SECTION.
       01 DATA-SCREEN.
           05 DEPOSIT.
               10 VALUE "DATA SCREEN" BLANK SCREEN LINE 1 COL 30.
               10 VALUE "ACCOUNT NUMBER : " LINE 3 COL 12.
               10 VALUE "ACCOUNT NAME : " LINE 5 COL 12.
               10 VALUE "PRINCIPAL AMOUNT : " LINE 7 COL 12.
               10 VALUE "YEARS OF DEPOSIT : " LINE 9 COL 12.
           05 RESPOND.
               10 VALUE "C - TO CONTINUE" LINE 16 COL 30.
               10 VALUE "Q - TO QUIT" LINE 18 COL 30.
               10 VALUE "ENTER CHOICE : " LINE 20 COL 30.
               10 RESPONSE PIC X TO THE_CHOICE.

       PROCEDURE DIVISION.
       MAINLINE.
           PERFORM A-100-INITIALIZE.
           PERFORM B-200-LOOP UNTIL THE_CHOICE = "Q".
           PERFORM C-100-TERMINATE.

       A-100-INITIALIZE.
           OPEN OUTPUT OUTPUT-FILE.
       B-200-LOOP.
           DISPLAY DEPOSIT.

           ACCEPT ACCOUNT_NUMBER LINE 3 COL 40.
           ACCEPT ACCOUNT_NAME LINE 5 COL 40.
           ACCEPT PRINCIPAL_AMOUNT LINE 7 COL 40.
           ACCEPT YEARS_OF_DEPOSIT LINE 9 COL 40.
           IF PRINCIPAL_AMOUNT >= 5000
               AND YEARS_OF_DEPOSIT >= 3 THEN

               DISPLAY "INTEREST RATE = 10%" LINE 12 COL 16
               *>COMPUTE INTEREST = (PRINCIPAL_AMOUNT / 100) * 10
                 DIVIDE PRINCIPAL_AMOUNT BY 100 GIVING CONVERT
                 MULTIPLY CONVERT BY 10 GIVING INTEREST
      *>            COMPUTE CONVERT = (PRINCIPAL_AMOUNT / 100) * 7
                 DISPLAY INTEREST LINE 15 COL 16
                 MOVE "10%"  TO PERCENT





           ELSE IF PRINCIPAL_AMOUNT >= 5000
               AND YEARS_OF_DEPOSIT < 3
               THEN
               DISPLAY "INTEREST RATE = 8 %"  LINE 12 COL 16
                *>COMPUTE INTEREST = (PRINCIPAL_AMOUNT / 100) * 8
               DIVIDE PRINCIPAL_AMOUNT BY 100 GIVING CONVERT
               MULTIPLY CONVERT BY 8 GIVING INTEREST
      *>            COMPUTE CONVERT = (PRINCIPAL_AMOUNT / 100) * 7
               DISPLAY INTEREST LINE 15 COL 16
               MOVE "8%" TO PERCENT


            ELSE IF PRINCIPAL_AMOUNT < 5000
                THEN
                 DISPLAY "INTEREST RATE = 7%"  LINE 12 COL 16
                 DIVIDE PRINCIPAL_AMOUNT BY 100 GIVING CONVERT
                 MULTIPLY CONVERT BY 7 GIVING INTEREST
      *>            COMPUTE CONVERT = (PRINCIPAL_AMOUNT / 100) * 7
                 DISPLAY INTEREST LINE 15 COL 16
               *>DIVIDE PRINCIPAL_AMOUNT BY 100 GIVING INTEREST
               MOVE "7%" TO PERCENT


           ELSE
               DISPLAY "ERROR" LINE 15 COL 16
           END-IF.


           MOVE ACCOUNT_NUMBER TO ACCOUNT_NUMBER_OUT.
           MOVE "   " TO SPACE-01-OUT.
           MOVE ACCOUNT_NAME TO ACCOUNT_NAME_OUT.
           MOVE "   " TO SPACE-02-OUT.
           MOVE PRINCIPAL_AMOUNT TO PRINCIPAL_AMOUNT_OUT.
           MOVE "   " TO SPACE-03-OUT.
           MOVE YEARS_OF_DEPOSIT TO YEARS_OF_DEPOSIT_OUT.
           MOVE "    " TO DIVIDER.

           MOVE INTEREST TO INTEREST-OUT.
           MOVE "    " TO DIVIDER-02.
           MOVE PERCENT TO PERCENT-OUT.

           WRITE OUTPUT-REC.
           DISPLAY RESPOND.
           ACCEPT RESPOND.





       C-100-TERMINATE.
           STOP RUN.





       END PROGRAM ESCABARTE2.
